SpenceKonde/ATTinyCore/avr/libraries/Wire/src/Wire.cpp
uint8_t TwoWire::requestFrom(uint8_t address, uint8_t quantity) {
  return requestFrom((uint8_t)address, (uint8_t)quantity, (uint8_t)true);
}

uint8_t TwoWire::requestFrom(int address, int quantity) {
  return requestFrom((uint8_t)address, (uint8_t)quantity, (uint8_t)true);
}

uint8_t TwoWire::requestFrom(int address, int quantity, int sendStop) {
  return requestFrom((uint8_t)address, (uint8_t)quantity, (uint8_t)sendStop);
}

void TwoWire::beginTransmission(uint8_t address) {
  // indicate that we are transmitting
  transmitting = 1;
  // set address of targeted slave and write mode
  Buffer[0] = (address << TWI_ADR_BITS) | (0 << TWI_READ_BIT);
  // reset tx buffer iterator vars
  BufferIndex = 1; // reserved by slave address
  BufferLength = BufferIndex;
}

void TwoWire::beginTransmission(int address) {
  beginTransmission((uint8_t)address);
}

uint8_t TwoWire::endTransmission(uint8_t sendStop) {
  // transmit buffer (blocking)
  uint8_t ret = USI_TWI_Start_Transceiver_With_Data_Stop(Buffer,
                                                         BufferLength,
                                                         sendStop);
  // reset tx buffer iterator vars
  BufferIndex = 0;
  BufferLength = 0;
  // indicate that we are done transmitting
  transmitting = 0;
  // check for error
  if (ret == FALSE) {
    switch (USI_TWI_Get_State_Info()) {
    case USI_TWI_DATA_OUT_OF_BOUND:
      return 1; //data too long to fit in transmit buffer
    case USI_TWI_NO_ACK_ON_ADDRESS:
      return 2; //received NACK on transmit of address
    case USI_TWI_NO_ACK_ON_DATA:
      return 3; //received NACK on transmit of data
    case USI_TWI_TIMEOUT:
      return 5; //timeout
    }
    return 4; //other error
  }
  return 0; //success
}

uint8_t TwoWire::endTransmission(void) {
  return endTransmission(true);
}

// must be called in:
// slave tx event callback
// or after beginTransmission(address)
size_t TwoWire::write(uint8_t data) {
  if (transmitting) { // in master transmitter mode
    // don't bother if buffer is full
    if (BufferLength >= TWI_BUFFER_SIZE) {
      return 0;
    }
    // put byte in tx buffer
    Buffer[BufferIndex] = data;
    ++BufferIndex;
    // update amount in buffer
    BufferLength = BufferIndex;
  } else { // in slave send mode
    // don't bother if buffer is full
    if (!USI_TWI_Space_In_Transmission_Buffer()) {
      return 0;
    }
    // reply to master
    USI_TWI_Transmit_Byte(data);
  }
  return 1;
}

// must be called in:
// slave tx event callback
// or after beginTransmission(address)
size_t TwoWire::write(const uint8_t *data, size_t quantity) {
  size_t numBytes = 0;
  for (size_t i = 0; i < quantity; ++i){
    numBytes += write(data[i]);
  }
  return numBytes;
}

// must be called in:
// slave tx event callback
// or after beginTransmission(address)
size_t TwoWire::write(const char *str) {
  if (str == NULL) return 0;
  return write((const uint8_t *)str, strlen(str));
}

// must be called in:
// slave rx event callback
// or after requestFrom(address, numBytes)
int TwoWire::available(void) {
  if (BufferLength) {
    return BufferLength - BufferIndex;
  } else {
    return USI_TWI_Data_In_Receive_Buffer();
  }
}

// must be called in:
// slave rx event callback
// or after requestFrom(address, numBytes)
int TwoWire::read(void) {
  int value = -1;

  // get each successive byte on each call
  if (available()) {
    if (BufferLength) {
      value = Buffer[BufferIndex];
      ++BufferIndex;
    } else {
      value = USI_TWI_Receive_Byte();
    }
  }

  return value;
}

// must be called in:
// slave rx event callback
// or after requestFrom(address, numBytes)
int TwoWire::peek(void) {
  int value = -1;

  if (available()) {
    if (BufferLength) {
      value = Buffer[BufferIndex];
    } else {
      value = USI_TWI_Peek_Receive_Byte();
    }
  }

  return value;
}

void TwoWire::flush(void) {
  // XXX: to be implemented.
}

// sets function called on slave write
void TwoWire::onReceive( void (*function)(int) ) {
  USI_TWI_On_Slave_Receive = function;
}

// sets function called on slave read
void TwoWire::onRequest( void (*function)(void) ) {
  USI_TWI_On_Slave_Transmit = function;
}

// return true on I2C/TWI activity
uint8_t TwoWire::isActive(void) {
  return USI_TWI_Slave_Is_Active();
}

// Preinstantiate Objects //////////////////////////////////////////////////////s
TwoWire Wire = TwoWire();
#else
#if defined(TWSD) && !defined(__AVR_ATtiny1634__)

#include "Wire.h"
//#include "TWSWire.h"
#include <string.h>

#if defined(__AVR_ATtiny841__) || defined(__AVR_ATtiny441__)
#define SCL_PIN 4
#define SCL_PORT PORTA
#define SDA_PIN 6
#define SDA_PORT PORTA
#elif defined(__AVR_ATtiny828__)
#define SCL_PIN 3
#define SCL_PORT PORTD
#define SDA_PIN 0
#define SDA_PORT PORTD
#else
#error No pins for software I2C defined
#endif
#define I2C_TIMEOUT 100
#ifndef WIRE_SLAVE_ONLY
#include "SoftWire.h"
static SoftWire softWire;
#endif

#ifndef WIRE_MASTER_ONLY
#include "WireS.h"
#endif

// Constructors ////////////////////////////////////////////////////////////////
//#ifndef WIRE_MASTER_ONLY
TwoWire::TwoWire() : slaveMode(false) {
}
//#else
//TwoWire::TwoWire()
//#endif
// Public Methods //////////////////////////////////////////////////////////////

#ifdef WIRE_BOTH
void TwoWire::begin(void) {
  softWire.begin();
  slaveMode = false;
}
#endif
#ifdef WIRE_MASTER_ONLY
void TwoWire::begin(void) {
  softWire.begin();
}
#endif


#ifndef WIRE_MASTER_ONLY
void TwoWire::begin(uint8_t address) {
  TinyWireS.begin(address, 0);
  slaveMode = true;
}

void TwoWire::begin(int address) {
  begin((uint8_t)address);
}
#endif

void TwoWire::end(void) {
  // XXX: to be implemented.
}

void TwoWire::setClock(uint32_t clock) {
  // XXX: to be implemented.
  (void)clock; //disable warning
}

void TwoWire::setWireTimeout(uint32_t timeout, bool reset_with_timeout)
{
  // XXX: to be implemented.
  (void)timeout; //disable warning
  (void)reset_with_timeout; //disable warning
}

/***
 * Returns the timeout flag.
 *
 * @return true if timeout has occured since the flag was last cleared.
 */
bool TwoWire::getWireTimeoutFlag(void)
{
  // XXX: to be implemented.
  return false;
}

