SpenceKonde/ATTinyCore/avr/libraries/Wire/src/Wire.cpp
/***
 * Clears the timeout flag.
 */
void TwoWire::clearWireTimeoutFlag(void)
{
  // XXX: to be implemented.
}

#ifndef WIRE_SLAVE_ONLY
uint8_t TwoWire::requestFrom(uint8_t address, uint8_t quantity,
  uint32_t iaddress, uint8_t isize,
  uint8_t sendStop) {
  #ifndef WIRE_MASTER_ONLY
  if (!slaveMode) {
    #endif
    return softWire.requestFrom(address, quantity, iaddress, isize, sendStop);
  #ifndef WIRE_MASTER_ONLY
  }
  return 0;
  #endif
}

uint8_t TwoWire::requestFrom(uint8_t address, uint8_t quantity,
  uint8_t sendStop) {
  return requestFrom((uint8_t)address, (uint8_t)quantity, (uint32_t)0,
    (uint8_t)0, (uint8_t)sendStop);
}

uint8_t TwoWire::requestFrom(uint8_t address, uint8_t quantity) {
  return requestFrom((uint8_t)address, (uint8_t)quantity, (uint8_t)true);
}

uint8_t TwoWire::requestFrom(int address, int quantity) {
  return requestFrom((uint8_t)address, (uint8_t)quantity, (uint8_t)true);
}

uint8_t TwoWire::requestFrom(int address, int quantity, int sendStop) {
  return requestFrom((uint8_t)address, (uint8_t)quantity, (uint8_t)sendStop);
}

void TwoWire::beginTransmission(uint8_t address) {
  if (!slaveMode) {
    softWire.beginTransmission(address);
  }
}

void TwoWire::beginTransmission(int address) {
  beginTransmission((uint8_t)address);
}

uint8_t TwoWire::endTransmission(uint8_t sendStop) {

  #ifndef WIRE_MASTER_ONLY
  if (!slaveMode) {
  #endif
    return softWire.endTransmission(sendStop);
  #ifndef WIRE_MASTER_ONLY
  }
  return 4; //other error
  #endif
}

uint8_t TwoWire::endTransmission(void) {
  return endTransmission(true);
}

#endif //stuff that's not there in slave only

// must be called in:
// slave tx event callback
// or after beginTransmission(address)



#if defined(WIRE_BOTH)
size_t TwoWire::write(uint8_t data) {
  size_t numBytes = 0;
  if (!slaveMode) {
    numBytes = softWire.write(data);
  }
  else {
    numBytes = TinyWireS.write(data);
  }
  return numBytes;
}

// must be called in:
// slave tx event callback
// or after beginTransmission(address)

// must be called in:
// slave tx event callback
// or after beginTransmission(address)


// must be called in:
// slave rx event callback
// or after requestFrom(address, numBytes)
int TwoWire::available(void) {
  int value = -1;
  if (!slaveMode) {
    value = softWire.available();
  }
  else {
    value = TinyWireS.available();
  }
  return value;
}

// must be called in:
// slave rx event callback
// or after requestFrom(address, numBytes)
int TwoWire::read(void) {
  int value = -1;
  if (!slaveMode) {
    value = softWire.read();
  }
  else {
    value = TinyWireS.read();
  }
  return value;
}

// must be called in:
// slave rx event callback
// or after requestFrom(address, numBytes)
int TwoWire::peek(void) {
  int value = -1;
  if (!slaveMode) {
    value = softWire.peek();
  }
  else {
    value = TinyWireS.peek();
  }
  return value;
}
#elif defined(WIRE_MASTER_ONLY)
size_t TwoWire::write(uint8_t data) {
  size_t numBytes = 0;
    numBytes = softWire.write(data);
  return numBytes;
}

// must be called in:
// slave tx event callback
// or after beginTransmission(address)


// must be called in:
// slave tx event callback
// or after beginTransmission(address)


// must be called in:
// slave rx event callback
// or after requestFrom(address, numBytes)
int TwoWire::available(void) {
  int value = -1;
    value = softWire.available();
  return value;
}

// must be called in:
// slave rx event callback
// or after requestFrom(address, numBytes)
int TwoWire::read(void) {
  int value = -1;
  value = softWire.read();
  return value;
}

// must be called in:
// slave rx event callback
// or after requestFrom(address, numBytes)
int TwoWire::peek(void) {
  int value = -1;
  value = softWire.peek();
  return value;
}
#else //WIRE_SLAVE_ONLY
size_t TwoWire::write(uint8_t data) {
  size_t numBytes = 0;
  numBytes = TinyWireS.write(data);
  return numBytes;
}

// must be called in:
// slave tx event callback
// or after beginTransmission(address)


// must be called in:
// slave tx event callback
// or after beginTransmission(address)


// must be called in:
// slave rx event callback
// or after requestFrom(address, numBytes)
int TwoWire::available(void) {
  int value = -1;
  value = TinyWireS.available();
  return value;
}

// must be called in:
// slave rx event callback
// or after requestFrom(address, numBytes)
int TwoWire::read(void) {
  int value = -1;
    value = TinyWireS.read();
  return value;
}

// must be called in:
// slave rx event callback
// or after requestFrom(address, numBytes)
int TwoWire::peek(void) {
  int value = -1;
  value = TinyWireS.peek();
  return value;
}

#endif

size_t TwoWire::write(const uint8_t *data, size_t quantity) {
  size_t numBytes = 0;
  for (size_t i = 0; i < quantity; ++i) {
    numBytes += write(data[i]);
  }
  return numBytes;
}

size_t TwoWire::write(const char *str) {
  if (str == NULL) return 0;
  return write((const uint8_t *)str, strlen(str));
}

void TwoWire::flush(void) {
  // XXX: to be implemented.
}
#ifndef WIRE_MASTER_ONLY
// sets function called on slave write
//void TwoWire::onReceive(void(*function)(int)) {
//  TinyWireS.onReceive(function);
//}
void TwoWire::onReceive( void (*function)(size_t) ) {
  TinyWireS.onReceive(function);
}


void TwoWire::onReceive( void (*function)(int) ) {
  // arduino api compatibility fixer:
  // really hope size parameter will not exceed 2^31 :)
  static_assert(sizeof(int) == sizeof(size_t), "something is wrong in Arduino kingdom");
  TinyWireS.onReceive(reinterpret_cast<void(*)(size_t)>(function));
}

// sets function called on slave read
void TwoWire::onRequest(void(*function)(void)) {
  TinyWireS.onRequest(function);
}
#endif

// Preinstantiate Objects //////////////////////////////////////////////////////
TwoWire Wire = TwoWire();
#else
#error No Wire support on unknown board
#endif // TWSD
#endif // USIDR
#endif // TWDR
